Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.DimensionExaggerationAttributes Constructor (Boolean, DimensionSetBaseAttributes.ExaggerationDirections, DimensionSetBaseAttributes.ExaggerationOrigins, Double, Double, Double)
 Creates a new dimension exaggeration attributes instance with the given parameters.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DimensionExaggerationAttributes(
	bool ExaggerationEnabled,
	DimensionSetBaseAttributes.ExaggerationDirections ExaggerationDirection,
	DimensionSetBaseAttributes.ExaggerationOrigins ExaggerationOrigin,
	double ExaggerationWidth,
	double ExaggerationPosition,
	double ExaggerationHeight
)
Public Sub New (
	ExaggerationEnabled As Boolean,
	ExaggerationDirection As DimensionSetBaseAttributes.ExaggerationDirections,
	ExaggerationOrigin As DimensionSetBaseAttributes.ExaggerationOrigins,
	ExaggerationWidth As Double,
	ExaggerationPosition As Double,
	ExaggerationHeight As Double
)
Parameters
ExaggerationEnabled
Type: System.Boolean
Exaggeration is enabled if the value is true.
ExaggerationDirection
Type: Tekla.Structures.Drawing.DimensionSetBaseAttributes.ExaggerationDirections
[Missing <param name="ExaggerationDirection"/> documentation for "M:Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionExaggerationAttributes.#ctor(System.Boolean,Tekla.Structures.Drawing.DimensionSetBaseAttributes.ExaggerationDirections,Tekla.Structures.Drawing.DimensionSetBaseAttributes.ExaggerationOrigins,System.Double,System.Double,System.Double)"]
ExaggerationOrigin
Type: Tekla.Structures.Drawing.DimensionSetBaseAttributes.ExaggerationOrigins
[Missing <param name="ExaggerationOrigin"/> documentation for "M:Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionExaggerationAttributes.#ctor(System.Boolean,Tekla.Structures.Drawing.DimensionSetBaseAttributes.ExaggerationDirections,Tekla.Structures.Drawing.DimensionSetBaseAttributes.ExaggerationOrigins,System.Double,System.Double,System.Double)"]
ExaggerationWidth
Type: System.Double
[Missing <param name="ExaggerationWidth"/> documentation for "M:Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionExaggerationAttributes.#ctor(System.Boolean,Tekla.Structures.Drawing.DimensionSetBaseAttributes.ExaggerationDirections,Tekla.Structures.Drawing.DimensionSetBaseAttributes.ExaggerationOrigins,System.Double,System.Double,System.Double)"]
ExaggerationPosition
Type: System.Double
[Missing <param name="ExaggerationPosition"/> documentation for "M:Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionExaggerationAttributes.#ctor(System.Boolean,Tekla.Structures.Drawing.DimensionSetBaseAttributes.ExaggerationDirections,Tekla.Structures.Drawing.DimensionSetBaseAttributes.ExaggerationOrigins,System.Double,System.Double,System.Double)"]
ExaggerationHeight
Type: System.Double
[Missing <param name="ExaggerationHeight"/> documentation for "M:Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionExaggerationAttributes.#ctor(System.Boolean,Tekla.Structures.Drawing.DimensionSetBaseAttributes.ExaggerationDirections,Tekla.Structures.Drawing.DimensionSetBaseAttributes.ExaggerationOrigins,System.Double,System.Double,System.Double)"]
See Also
Reference
DimensionSetBaseAttributes.DimensionExaggerationAttributes Class
DimensionSetBaseAttributes.DimensionExaggerationAttributes Overload
Tekla.Structures.Drawing Namespace